Revit 2027 API
ExportLineweightTable.ContainsKey Method
 Checks whether a line weight key exists in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsKey(
	ExportLineweightKey exportLineweightKey
)
Public Function ContainsKey (
	exportLineweightKey As ExportLineweightKey
) As Boolean
public:
bool ContainsKey(
	ExportLineweightKey^ exportLineweightKey
)
member ContainsKey :
        exportLineweightKey : ExportLineweightKey -> bool
Parameters
exportLineweightKey ExportLineweightKey
 The export line weight key.
Return Value
Boolean
 True if the line weight exists in the table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace